app/controllers/store_controller.rb

INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2012-03-26 06:20:13', 1, 1, 1, 29.0, '2012-03-26 06:20:13')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('Anand Gupta', 'Teli bagh,Lucknow', '2012-03-26 06:20:13', '2012-03-26 06:20:13', 'cc', 'anand.sunny.7@gmail.com')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order]) # order parameter i have passed it from checkout.html.erb page
    @order.add_line_items_from_cart(@cart)
    if @order.save